        IDENTIFICATION DIVISION.
            PROGRAM-ID. hello.
        DATA DIVISION.
        PROCEDURE DIVISION.
            DISPLAY "Hello, world!".
        STOP RUN.
